In [17]:
#import libraries for machine learning 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline
import warnings 
warnings.filterwarnings('ignore')
import sklearn
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn import metrics
from sklearn.metrics import mean_squared_error
from sklearn.metrics import r2_score
from sklearn.metrics import mean_absolute_error
#import random forest regressor
from sklearn.ensemble import RandomForestRegressor

In [33]:
#read the data
muestra = pd.read_csv('muestra.csv')
salaries = pd.read_csv('salaries_data.csv')
testeo = pd.read_csv('testeo.csv')

In [34]:
salaries.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,USD,140250,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,USD,135000,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,USD,100000,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,USD,270000,US,100,US,L
4,2021,MI,FT,Data Engineer,22000,EUR,26005,RO,0,US,L

In [35]:
salaries.drop('salary_currency', axis=1, inplace=True)

In [36]:
salaries.drop('salary', axis=1, inplace=True)

In [24]:
#salaries.employee_residence = ['other' if x not in ctrs else x for x in salaries.employee_residence]

In [30]:
#cmpny = salaries.company_location.value_counts()[:10]

In [31]:
#salaries.company_location = ['other' if x not in cmpny else x for x in salaries.company_location]

In [40]:
salaries.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,US,100,US,L
4,2021,MI,FT,Data Engineer,26005,RO,0,US,L

In [50]:
salaries.job_title = salaries.job_title.str.lower()
salaries.job_title.value_counts()

data scientist                              121
data engineer                               111
data analyst                                 81
machine learning engineer                    31
research scientist                           12
data science manager                         12
data architect                                8
machine learning scientist                    7
data analytics manager                        7
big data engineer                             7
director of data science                      7
ml engineer                                   6
lead data engineer                            6
principal data scientist                      6
applied data scientist                        5
data engineering manager                      5
data science consultant                       5
ai scientist                                  5
bi data analyst                               5
head of data                                  4
business data analyst                         4
computer vision engineer                      4
analytics engineer                            3
lead data scientist                           3
applied machine learning scientist            3
cloud data engineer                           2
machine learning infrastructure engineer      2
lead data analyst                             2
data analytics engineer                       2
director of data engineering                  2
etl developer                                 2
head of data science                          2
machine learning developer                    2
data science engineer                         2
machine learning manager                      1
staff data scientist                          1
head of machine learning                      1
finance data analyst                          1
financial data analyst                        1
data analytics lead                           1
3d computer vision researcher                 1
principal data analyst                        1
product data analyst                          1
big data architect                            1
data specialist                               1
lead machine learning engineer                1
marketing data analyst                        1
computer vision software engineer             1
Name: job_title, dtype: int64

In [72]:
salaries.job_title.value_counts()[:10]
#clean the rest of the column into categories like if it says ML or machine learning it will become machine learning
salaries.job_title = ['machine learning' if 'ml' in x or 'machine learning' in x or 'ai' in x else x for x in salaries.job_title] 
salaries.job_title = ['data scientist' if 'data scientist' in x or 'science' in x else x for x in salaries.job_title]
salaries.job_title = ['data engineer' if 'data engineer' in x else x for x in salaries.job_title]
salaries.job_title = ['data analyst' if 'data analyst' in x or 'analytics' in x or 'analyst' in x else x for x in salaries.job_title]
salaries.job_title = ['data architect' if 'data architect' in x or 'architect' in x else x for x in salaries.job_title]
salaries.job_title = ['computer vision' if 'computer vision' in x or 'vision' in x else x for x in salaries.job_title]

In [73]:
salaries.job_title.value_counts()

data scientist        164
data engineer         133
data analyst          110
machine learning       59
research scientist     12
data architect          9
computer vision         6
head of data            4
etl developer           2
data specialist         1
Name: job_title, dtype: int64

In [75]:
testeo.head()
#same cleaning as the salaries data job title now for the testeo data
testeo.job_title = testeo.job_title.str.lower()
testeo.job_title = ['machine learning' if 'ml' in x or 'machine learning' in x or 'ai' in x else x for x in testeo.job_title]
testeo.job_title = ['data scientist' if 'data scientist' in x or 'science' in x else x for x in testeo.job_title]
testeo.job_title = ['data engineer' if 'data engineer' in x else x for x in testeo.job_title]
testeo.job_title = ['data analyst' if 'data analyst' in x or 'analytics' in x or 'analyst' in x else x for x in testeo.job_title]
testeo.job_title = ['data architect' if 'data architect' in x or 'architect' in x else x for x in testeo.job_title]
testeo.job_title = ['computer vision' if 'computer vision' in x or 'vision' in x else x for x in testeo.job_title]

In [76]:
testeo.job_title.value_counts()

data scientist        28
data analyst          25
data engineer         25
machine learning      16
computer vision        4
research scientist     4
data architect         3
head of data           1
nlp engineer           1
Name: job_title, dtype: int64